# AssetProperty Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetProperty Properties
AssetProperty Class See Also
---
The AssetProperty type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | Get the name of the AssetProperty |
| NumberOfConnectedProperties | The number of currently connected properties. |
| Type | Returns the type of the AssetProperty |

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace